app/Controllers/Categorias.php

    public function index($activo = 1)
    {
        $categorias = $this->categorias->where('activo',$activo)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1

    public function editar($id)
    {
        $unidad = $this->categorias->where('id',$id)->first();
---
SELECT *
FROM `categorias`
WHERE `id` = '2'
 LIMIT 1