app/Controllers/Unidades.php

    public function eliminar($id)
    {
        $this->unidades->update($id,['activo'=>0]);
---
UPDATE `unidades` SET `activo` = 0, `fecha_edit` = '2024-01-31 00:40:15'
WHERE `unidades`.`id` IN ('10')